// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
// タイトル処理 [basemode.cpp]
// Author : Nishiyama Koki
//
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "basemode.h"
#include "game.h"
#include "scene.h"
#include "debugproc.h"
#include "keyboard.h"
#include "fade.h"
#include "renderer.h"
#include "manager.h"
#include "stencilshadow.h"
#include "camera.h"
#include "baseblock.h"

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
// マクロ定義
//
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
// 静的変数宣言
//
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
bool	CBaseMode::m_bCollisionDisp = true;				// 当たり判定の可視化状態

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// コンストラクタ
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CBaseMode::CBaseMode()
{
	m_bSceneStop = false;	// シーンを止めるフラグ
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// デストラクタ
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CBaseMode::~CBaseMode()
{
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 初期化処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CBaseMode::Init(void)
{
	// 遷移時間の初期化
	m_TransitionCnt = TRANSTION_TIME;
	// 各カメラモードの初期設定
	CManager::GetRenderer()->GetCamera()->ModeCameraInit();
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 終了処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CBaseMode::Uninit(void)
{
	CScene::ReleaseAll();
	// シーンストップ解除
	CScene::UpdateStop(false);
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 更新処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CBaseMode::Update(void)
{

}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 描画処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CBaseMode::Draw(void)
{
}

#ifdef _DEBUG
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// デバッグ処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CBaseMode::Debug(void)
{
	//キーボード取得
	CKeyboard *key = CManager::GetKeyboard();

	// デバッグコマンド
	CDebugproc::Print(NEWLINE);
	CDebugproc::Print("--------- Debug Command ----------\n");
	CDebugproc::Print("[F3] : 一時停止 [ %d ] : [ OFF : 0 / ON : 1 ]\n", m_bSceneStop);
	CDebugproc::Print("[F4] : 1フレームだけ更新\n");
	CDebugproc::Print("[F5] : 当たり判定の可視状態\n");
	CDebugproc::Print(NEWLINE);
	CDebugproc::Print("[Ctrl] + テンキー [0] : 現在のModeに遷移\n");
	CDebugproc::Print("[Ctrl] + テンキー [1] : Titleに遷移\n");
	CDebugproc::Print("[Ctrl] + テンキー [2] : Tutorialに遷移\n");
	CDebugproc::Print("[Ctrl] + テンキー [3] : Gameに遷移\n");
	CDebugproc::Print("[Ctrl] + テンキー [4] : Resultに遷移\n");
	CDebugproc::Print("[Ctrl] + テンキー [5] : Openingに遷移\n");

	CDebugproc::Print(NEWLINE);

	// 現在のモード表記
	switch (CManager::GetMode())
	{
	case CManager::MODE_TITLE:
		CDebugproc::Print("現在のモード : [ Title ]\n");
		break;

	case CManager::MODE_TUTORIAL:
		CDebugproc::Print("現在のモード : [ Tutorial ]\n");
		break;

	case CManager::MODE_GAME:
		CDebugproc::Print("現在のモード : [ Game ]\n");
		break;

	case CManager::MODE_RESULT:
		CDebugproc::Print("現在のモード : [ Result ]\n");
		break;

	case CManager::MODE_OPENING:
		CDebugproc::Print("現在のモード : [ OPENING ]\n");
		break;

	}

	// 一時停止
	if (key->GetKeyboardTrigger(DIK_F3))
	{
		m_bSceneStop ^= 1;
		CScene::UpdateStop(m_bSceneStop);
	}
	// 1Fだけ更新する
	if (key->GetKeyboardTrigger(DIK_F4))
	{
		CScene::Set1FUpdate();
	}
	//当たり判定の可視状態
	if (key->GetKeyboardTrigger(DIK_F5))
	{
		m_bCollisionDisp = !m_bCollisionDisp;
	}
	// ステンシル描画状態の設定
	if (key->GetKeyboardTrigger(DIK_F6))
	{
		CStencilshadow::SetStencil(!CStencilshadow::GetStencil());
	}
	// Ctrl押しながら
	if (key->GetKeyboardPress(DIK_LCONTROL))
	{
		// フェード状態が何も起こっていない状態なら
		if (CManager::GetFade()->GetFade() == CFade::FADE_NONE)
		{
			// 現在のモード再始動
			if (key->GetKeyboardTrigger(DIK_NUMPAD0))
			{
				CManager::GetFade()->SetFade(CManager::GetMode());
			}
			//タイトル
			if (key->GetKeyboardTrigger(DIK_NUMPAD1))
			{
				CManager::GetFade()->SetFade(CManager::MODE_TITLE);
			}
			//チュートリアル
			if (key->GetKeyboardTrigger(DIK_NUMPAD2))
			{
				CManager::GetFade()->SetFade(CManager::MODE_TUTORIAL);
			}
			// ゲーム
			if (key->GetKeyboardTrigger(DIK_NUMPAD3))
			{
				CManager::GetFade()->SetFade(CManager::MODE_GAME);
			}
			// リザルト
			if (key->GetKeyboardTrigger(DIK_NUMPAD4))
			{
				CManager::GetFade()->SetFade(CManager::MODE_RESULT);
			}
			// オープニング
			if (key->GetKeyboardTrigger(DIK_NUMPAD5))
			{
				CManager::GetFade()->SetFade(CManager::MODE_OPENING);
			}
		}
	}

	// ブロック全体のデバッグ処理
	CBaseblock::AllDebug();

}
#endif // _DEBUG