// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
// 普通ブロック処理 [normalblock.cpp]
// Author : KOKI NISHIYAMA
//
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "normalblock.h"
#include "collision.h"
#include "debugproc.h"

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
// マクロ定義
//
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
// 静的変数宣言
//
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// オーバーローバーコンストラクタ処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CNormalblock::CNormalblock() : CBaseblock::CBaseblock()
{

}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// デストラクタ処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CNormalblock::~CNormalblock()
{
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 初期化処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::Init()
{
	// ブロックタイプの設定
	CBaseblock::SetType(TYPE_NORMAL);	// 普通のブロックタイプ
	// 落ちる設定
	CBaseblock::SetFall(true);
	// ベースブロック初期化処理
	CBaseblock::Init();
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 終了処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::Uninit(void)
{
	CBaseblock::Uninit();
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 更新処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::Update(void)
{
	CBaseblock::Update();
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 描画処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::Draw(void)
{
	CBaseblock::Draw();
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 当たった後の処理
//	nObjType	: 相手オブジェクトタイプ
//	pScene		: 相手のシーン情報
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::Scene_MyCollision(
	int const & nObjType,
	CScene * pScene
)
{
	if (nObjType == CCollision::OBJTYPE_BLOCK)
	{
		// シーン情報がNULLなら
		// ->関数を抜ける
		if (pScene == NULL) return;
		if (!CBaseblock::GetFall()) return;
		// シーン情報の代入
		CBaseblock * pBaseBlock = (CBaseblock *)pScene;
		// 相手の落ちる状態がtrueなら
		// ->関数を抜ける
		if (pBaseBlock->GetFall()) return;
		// 変数宣言
		CBaseblock::GRID MyGrid = CBaseblock::GetGrid();	// 自分の行列高
		CBaseblock::GRID OppGrid = pBaseBlock->GetGrid();	// 相手の行列高
		// 同じ行列ではないなら
		// ->関数を抜ける
		if (!(MyGrid.nColumn == OppGrid.nColumn &&
			MyGrid.nLine == OppGrid.nLine)) return;
		int nHeight = CBaseblock::GetHeight(			// 高さ
			MyGrid.nColumn + BASEBLOCK_MINUSTOPLUS,
			MyGrid.nLine + BASEBLOCK_MINUSTOPLUS) + 1;
		// 高さを行列高に代入
		MyGrid.nHeight = nHeight;
		// 高さの設定
		CBaseblock::SetHeight(
			MyGrid.nColumn + BASEBLOCK_MINUSTOPLUS,
			MyGrid.nLine + BASEBLOCK_MINUSTOPLUS,
			MyGrid.nHeight
		);
		// 現在の行列高の設定
		CBaseblock::SetGrid(MyGrid);
		// 位置設定
		CBaseblock::SetPos((D3DXVECTOR3)MyGrid);
		// 落ちている状態設定
		CBaseblock::SetFall(false);
	}
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 相手に当てられた後の処理
//	nObjType	: 相手オブジェクトタイプ
//	pScene		: 相手のシーン情報
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::Scene_OpponentCollision(int const & nObjType, CScene * pScene)
{
	if (nObjType == CCollision::OBJTYPE_BLOCK)
	{
		// シーン情報がNULLなら
		// ->関数を抜ける
		if (pScene == NULL) return;
		if (!CBaseblock::GetFall()) return;
		// シーン情報の代入
		CBaseblock * pBaseBlock = (CBaseblock *)pScene;
		// 相手の落ちる状態がtrueなら
		// ->関数を抜ける
		if (pBaseBlock->GetFall()) return;
		// 変数宣言
		CBaseblock::GRID MyGrid = CBaseblock::GetGrid();	// 自分の行列高
		CBaseblock::GRID OppGrid = pBaseBlock->GetGrid();	// 相手の行列高
															// 同じ行列ではないなら
															// ->関数を抜ける
		if (!(MyGrid.nColumn == OppGrid.nColumn &&
			MyGrid.nLine == OppGrid.nLine)) return;
		int nHeight = CBaseblock::GetHeight(			// 高さ
			MyGrid.nColumn + BASEBLOCK_MINUSTOPLUS,
			MyGrid.nLine + BASEBLOCK_MINUSTOPLUS) + 1;
		// 高さを行列高に代入
		MyGrid.nHeight = nHeight;
		// 高さの設定
		CBaseblock::SetHeight(
			MyGrid.nColumn + BASEBLOCK_MINUSTOPLUS,
			MyGrid.nLine + BASEBLOCK_MINUSTOPLUS,
			MyGrid.nHeight
		);
		// 現在の行列高の設定
		CBaseblock::SetGrid(MyGrid);
		// 位置設定
		CBaseblock::SetPos((D3DXVECTOR3)MyGrid);
		// 落ちている状態設定
		CBaseblock::SetFall(false);
	}
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 当たった後の判定
//	Obj		: オブジェタイプ
//	pScene	: シーン情報
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::HitCollision(
	COLLISIONDIRECTION const &Direct,	// 前後左右上下
	CScene::OBJ const & Obj,			// オブジェタイプ
	CScene * pScene						// シーン情報
)
{
	// オブジェタイプがブロックなら
	if (CScene::OBJ_BLOCK == Obj)
	{
		if (Direct == COLLISIONDIRECTION::DOWN)
		{
			// シーン情報がNULLなら
			// ->関数を抜ける
			if (pScene == NULL) return;
			if (!CBaseblock::GetFall()) return;
			// シーン情報の代入
			CBaseblock * pBaseBlock = (CBaseblock *)pScene;
			// 相手の落ちる状態がtrueなら
			// ->関数を抜ける
			if (pBaseBlock->GetFall()) return;
			// 変数宣言
			CBaseblock::GRID MyGrid = CBaseblock::GetGrid();	// 自分の行列高
			CBaseblock::GRID OppGrid = pBaseBlock->GetGrid();	// 相手の行列高
																// 同じ行列ではないなら
																// ->関数を抜ける
			if (!(MyGrid.nColumn == OppGrid.nColumn &&
				MyGrid.nLine == OppGrid.nLine)) return;
			int nHeight = CBaseblock::GetHeight(			// 高さ
				MyGrid.nColumn + BASEBLOCK_MINUSTOPLUS,
				MyGrid.nLine + BASEBLOCK_MINUSTOPLUS) + 1;
			// 高さを行列高に代入
			MyGrid.nHeight = nHeight;
			// 高さの設定
			CBaseblock::SetHeight(
				MyGrid.nColumn + BASEBLOCK_MINUSTOPLUS,
				MyGrid.nLine + BASEBLOCK_MINUSTOPLUS,
				MyGrid.nHeight
			);
			// 現在の行列高の設定
			CBaseblock::SetGrid(MyGrid);
			// 位置設定
			CBaseblock::SetPos((D3DXVECTOR3)MyGrid);
			// 落ちている状態設定
			CBaseblock::SetFall(false);
		}
	}
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 普通ブロック全ソースの読み込み
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
HRESULT CNormalblock::Load(void)
{
	return S_OK;
}

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 読み込んだ情報を破棄処理
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::UnLoad(void)
{

}

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 作成(シーン管理)
//	pos			: 位置
//	nModelId	: モデル番号
//	layer		: レイヤー
// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CNormalblock * CNormalblock::Create(
	int				const & nModelId,	// モデル番号
	GRID			const & Grid,		// 行列高さ番号
	CScene::LAYER	const & layer		// レイヤー
)
{
	// 変数宣言
	CNormalblock * pNormalblock;		// シーン2Dクラス
	// メモリの生成(初め->基本クラス,後->派生クラス)
	pNormalblock = new CNormalblock();
	// 設定
	// シーン管理設定
	pNormalblock->ManageSetting(layer);
	pNormalblock->SetGrid(Grid);			// 行列高さ
	pNormalblock->SetPos(					// 位置
		D3DXVECTOR3(Grid.nColumn * BASEBLOCK_RANGE, Grid.nHeight * BASEBLOCK_RANGE, Grid.nLine * BASEBLOCK_RANGE));
	pNormalblock->SetModelId(nModelId);		// モデル番号
	// 初期化処理
	pNormalblock->Init();
	// 生成したオブジェクトを返す
	return pNormalblock;
	D3DXVECTOR3;
}

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 作成(個人管理)
//	pos			: 位置
//	nModelId	: モデル番号
// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CNormalblock * CNormalblock::Create_Self(
	int				const & nModelId,								// モデル番号
	GRID			const & Grid									// 行列高さ番号
)
{
	// 変数宣言
	CNormalblock * pNormalblock;		// シーン2Dクラス
	// メモリの生成(初め->基本クラス,後->派生クラス)
	pNormalblock = new CNormalblock;
	// 設定
	pNormalblock->SetGrid(Grid);			// 行列高さ
	pNormalblock->SetPos(					// 位置
		D3DXVECTOR3(Grid.nColumn * BASEBLOCK_RANGE, Grid.nHeight * BASEBLOCK_RANGE, Grid.nLine * BASEBLOCK_RANGE));
	pNormalblock->SetModelId(nModelId);		// モデル番号
	// 初期化処理
	pNormalblock->Init();
	// 生成したオブジェクトを返す
	return pNormalblock;
}

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// unique_ptr作成(個人管理unique)
// ※戻り値はstd::moveで受け取る
//	pos			: 位置
//	nModelId	: モデル番号
// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
std::unique_ptr<CNormalblock> CNormalblock::Creat_Unique(
	int				const & nModelId,								// モデル番号
	GRID			const & Grid									// 行列高さ番号
)
{
	// 変数宣言
	std::unique_ptr<CNormalblock> pNormalblock(new CNormalblock);		// シーン2Dクラス
	// 設定
	pNormalblock->SetGrid(Grid);			// 行列高さ
	pNormalblock->SetPos(					// 位置
		D3DXVECTOR3(Grid.nColumn * BASEBLOCK_RANGE, Grid.nHeight * BASEBLOCK_RANGE, Grid.nLine * BASEBLOCK_RANGE));
	pNormalblock->SetModelId(nModelId);		// モデル番号
	// 初期化処理
	pNormalblock->Init();
	// 生成したオブジェクトを返す
	return pNormalblock;
}


#ifdef _DEBUG
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// デバッグ表示
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CNormalblock::Debug(void)
{
	/*
	// 落ちる状態でなければ
	// 関数を抜ける
	if (CBaseblock::GetFall())
	{
		CDebugproc::Print("NormalBlock::Fall = true\n");
	}
	else
	{
		CDebugproc::Print("NormalBlock::Fall = false\n");
	}
	CDebugproc::Print("NormalBlock::Pos(%.2f,%.2f,%.2f)\n",CScene_X::GetPos().x, CScene_X::GetPos().y, CScene_X::GetPos().z);
	*/
}
#endif // _DEBUG

