//=============================================================================
//
// リザルトの処理 [result.cpp]
// Author : Ryouma Inoue
//
//=============================================================================
#include "result.h"
#include "fade.h"

#include "renderer.h"
#include "sound.h"
#include "scene.h"
#include "player.h"
#include "manager.h"
#include "ui.h"
#include "keyboard.h"

//=============================================================================
//
// コンストラクタ
//
//=============================================================================
CResult::CResult()
{
	nCntSkip = 0;
}

//=============================================================================
//
// デストラクタ
//
//=============================================================================
CResult::~CResult()
{

}

//=============================================================================
//
// 初期化処理
//
//=============================================================================
HRESULT CResult::Init()
{
	CUi::LoadCreate(CUi::UITYPE_RESULT);
	// 初期化
	return S_OK;
}

//=============================================================================
//
// 終了処理
//
//=============================================================================
void CResult::Uninit(void)
{
	// 全ての開放
	CScene::ReleaseAll();
}

//=============================================================================
//
// 更新処理
//
//=============================================================================
void CResult::Update(void)
{
	CFade *pFade = CManager::GetFade();

	// フェードしていないとき
	if (pFade->GetFade() == CFade::FADE_NONE)
	{
		// ゲームへ遷移
		if (CManager::GetKeyboard()->GetKeyboardPress(DIK_RETURN))
		{

			if (pFade->GetFade() == CFade::FADE_NONE)
			{
				// ゲームへ
				pFade->SetFade(CManager::MODE_TITLE);
			}
		}
		if (nCntSkip >= DERAY_TIME(55))
		{
			// ゲームへ
			pFade->SetFade(CManager::MODE_TITLE);
		}
	}
	// スキップカウントアップ
	nCntSkip++;
}

//=============================================================================
//
// 描画処理
//
//=============================================================================
void CResult::Draw(void)
{

}

//=============================================================================
//
// タイトルの生成
//
//=============================================================================
CResult * CResult::Create(void)
{
	// 変数
	CResult *pResult;

	// メモリの確保
	pResult = new CResult;

	// 初期化
	pResult->Init();

	return pResult;
}